Revit 2027 API
Connector.EngagementLength Property
 Connector engagement length. When applicable, it represents the inset distance to the end of the fabrication part from the connection point. Otherwise it returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EngagementLength { get; }
Public ReadOnly Property EngagementLength As Double
	Get
public:
property double EngagementLength {
	double get ();
}
member EngagementLength : float with get
Property Value
Double
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace